Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyLocked Property
 Can't copy pinned element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyLocked { get; }
Public Shared ReadOnly Property CannotCopyLocked As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyLocked {
	FailureDefinitionId^ get ();
}
static member CannotCopyLocked : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace